<?php 
namespace common\models;
?>
<?php 
class API_Furniture {
    public static function createCode($str)
    {
        $str = trim($str);
        $coDau = array("á","à","ả","ã","ạ","ă","ắ","ằ","ẳ","ẵ","ặ","ấ","ầ","ẩ","ẫ","ậ","â",
        "é","è","ẻ","ẽ","ẹ","ế","ề","ể","ễ","ệ","ê","ó","ò","ỏ","õ","ọ","ố","ồ","ổ","ỗ","ộ","ơ","ô",
        "ờ","ớ","ở","ỡ","ợ","ú","ù","ủ","ũ","ụ","ư","ứ","ừ","ử","ữ","ự","ý","ỳ","ỷ","ỹ","ỵ",
        "í","ì","ỉ","ĩ","ị","Á","À","Ả","Ã","Ạ","Ă","Ắ","Ằ","Ẳ","Ẵ","Ặ","Â","Ấ","Ầ",
        "Ẩ","Ẫ","Ậ","É","È","Ẻ","Ẽ","Ẹ","Ê","Ế","Ề","Ể","Ễ","Ệ","Ó","Ò","Ỏ","Õ",
        "Ọ","Ô","Ố","Ồ","Ổ","Ỗ","Ộ","Ơ","Ờ","Ớ","Ở","Ỡ","Ợ","Ú","Ù","Ủ","Ũ","Ụ","Ư",
        "Ứ","Ừ","Ử","Ữ","Ự","Ý","Ỳ","Ỷ","Ỹ","Ỵ","Í","Ì","Ỉ","Ĩ","Ị","Đ");
        $khongDau = array("a","a","a","a","a","a","a","a","a","a","a","a","a","a","a","a","a",
        "e","e","e","e","e","e","e","e","e","e","e","o","o","o","o","o","o","o","o","o","o","o","o",
        "o","o","o","o","o","u","u","u","u","u","u","u","u","u","u","u","y","y","y","y","y",
        "i","i","i","i","i","A","A","A","A","A","A","A","A","A","A","A","A","A","A",
        "A","A","A","E","E","E","E","E","E","E","E","E","E","E","O","O","O","O",
        "O","O","O","O","O","O","O","O","O","O","O","O","O","U","U","U","U","U","U",
        "U","U","U","U","U","Y","Y","Y","Y","Y","I","I","I","I","I","D");
        $str = str_replace($coDau,$khongDau, $str);
        $str = trim(preg_replace("/\\s+/"," ", $str));
        $str = preg_replace("/[^a-zA-Z0-9 \-\.]/", "", $str);
        $str = strtolower($str);
        return str_replace(" ", '-', $str);
    }
}

?>